Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM7_otg1_hs_host.h
/*
 * SPDX-License-Identifier: MIT
 * SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
 *
 * Generated using the .svd description
 * Goal:     stm32H747_CM7_otg1_hs_host equates.
 */

#pragma once

#include    <stdint.h>

// OTG1_HS_HOST address definitions
// --------------------------------

typedef struct {
    volatile    uint32_t    OTG_HS_HCFG;
    volatile    uint32_t    OTG_HS_HFIR;
    volatile    uint32_t    OTG_HS_HFNUM;
    volatile    uint32_t    RESERVED0;
    volatile    uint32_t    OTG_HS_HPTXSTS;
    volatile    uint32_t    OTG_HS_HAINT;
    volatile    uint32_t    OTG_HS_HAINTMSK;
    volatile    uint32_t    RESERVED1[9];
    volatile    uint32_t    OTG_HS_HPRT;
    volatile    uint32_t    RESERVED2[47];
    volatile    uint32_t    OTG_HS_HCCHAR0;
    volatile    uint32_t    OTG_HS_HCSPLT0;
    volatile    uint32_t    OTG_HS_HCINT0;
    volatile    uint32_t    OTG_HS_HCINTMSK0;
    volatile    uint32_t    OTG_HS_HCTSIZ0;
    volatile    uint32_t    OTG_HS_HCDMA0;
    volatile    uint32_t    RESERVED3[2];
    volatile    uint32_t    OTG_HS_HCCHAR1;
    volatile    uint32_t    OTG_HS_HCSPLT1;
    volatile    uint32_t    OTG_HS_HCINT1;
    volatile    uint32_t    OTG_HS_HCINTMSK1;
    volatile    uint32_t    OTG_HS_HCTSIZ1;
    volatile    uint32_t    OTG_HS_HCDMA1;
    volatile    uint32_t    RESERVED4[2];
    volatile    uint32_t    OTG_HS_HCCHAR2;
    volatile    uint32_t    OTG_HS_HCSPLT2;
    volatile    uint32_t    OTG_HS_HCINT2;
    volatile    uint32_t    OTG_HS_HCINTMSK2;
    volatile    uint32_t    OTG_HS_HCTSIZ2;
    volatile    uint32_t    OTG_HS_HCDMA2;
    volatile    uint32_t    RESERVED5[2];
    volatile    uint32_t    OTG_HS_HCCHAR3;
    volatile    uint32_t    OTG_HS_HCSPLT3;
    volatile    uint32_t    OTG_HS_HCINT3;
    volatile    uint32_t    OTG_HS_HCINTMSK3;
    volatile    uint32_t    OTG_HS_HCTSIZ3;
    volatile    uint32_t    OTG_HS_HCDMA3;
    volatile    uint32_t    RESERVED6[2];
    volatile    uint32_t    OTG_HS_HCCHAR4;
    volatile    uint32_t    OTG_HS_HCSPLT4;
    volatile    uint32_t    OTG_HS_HCINT4;
    volatile    uint32_t    OTG_HS_HCINTMSK4;
    volatile    uint32_t    OTG_HS_HCTSIZ4;
    volatile    uint32_t    OTG_HS_HCDMA4;
    volatile    uint32_t    RESERVED7[2];
    volatile    uint32_t    OTG_HS_HCCHAR5;
    volatile    uint32_t    OTG_HS_HCSPLT5;
    volatile    uint32_t    OTG_HS_HCINT5;
    volatile    uint32_t    OTG_HS_HCINTMSK5;
    volatile    uint32_t    OTG_HS_HCTSIZ5;
    volatile    uint32_t    OTG_HS_HCDMA5;
    volatile    uint32_t    RESERVED8[2];
    volatile    uint32_t    OTG_HS_HCCHAR6;
    volatile    uint32_t    OTG_HS_HCSPLT6;
    volatile    uint32_t    OTG_HS_HCINT6;
    volatile    uint32_t    OTG_HS_HCINTMSK6;
    volatile    uint32_t    OTG_HS_HCTSIZ6;
    volatile    uint32_t    OTG_HS_HCDMA6;
    volatile    uint32_t    RESERVED9[2];
    volatile    uint32_t    OTG_HS_HCCHAR7;
    volatile    uint32_t    OTG_HS_HCSPLT7;
    volatile    uint32_t    OTG_HS_HCINT7;
    volatile    uint32_t    OTG_HS_HCINTMSK7;
    volatile    uint32_t    OTG_HS_HCTSIZ7;
    volatile    uint32_t    OTG_HS_HCDMA7;
    volatile    uint32_t    RESERVED10[2];
    volatile    uint32_t    OTG_HS_HCCHAR8;
    volatile    uint32_t    OTG_HS_HCSPLT8;
    volatile    uint32_t    OTG_HS_HCINT8;
    volatile    uint32_t    OTG_HS_HCINTMSK8;
    volatile    uint32_t    OTG_HS_HCTSIZ8;
    volatile    uint32_t    OTG_HS_HCDMA8;
    volatile    uint32_t    RESERVED11[2];
    volatile    uint32_t    OTG_HS_HCCHAR9;
    volatile    uint32_t    OTG_HS_HCSPLT9;
    volatile    uint32_t    OTG_HS_HCINT9;
    volatile    uint32_t    OTG_HS_HCINTMSK9;
    volatile    uint32_t    OTG_HS_HCTSIZ9;
    volatile    uint32_t    OTG_HS_HCDMA9;
    volatile    uint32_t    RESERVED12[2];
    volatile    uint32_t    OTG_HS_HCCHAR10;
    volatile    uint32_t    OTG_HS_HCSPLT10;
    volatile    uint32_t    OTG_HS_HCINT10;
    volatile    uint32_t    OTG_HS_HCINTMSK10;
    volatile    uint32_t    OTG_HS_HCTSIZ10;
    volatile    uint32_t    OTG_HS_HCDMA10;
    volatile    uint32_t    RESERVED13[2];
    volatile    uint32_t    OTG_HS_HCCHAR11;
    volatile    uint32_t    OTG_HS_HCSPLT11;
    volatile    uint32_t    OTG_HS_HCINT11;
    volatile    uint32_t    OTG_HS_HCINTMSK11;
    volatile    uint32_t    OTG_HS_HCTSIZ11;
    volatile    uint32_t    OTG_HS_HCDMA11;
    volatile    uint32_t    OTG_HS_HCCHAR12;
    volatile    uint32_t    OTG_HS_HCSPLT12;
    volatile    uint32_t    OTG_HS_HCINT12;
    volatile    uint32_t    OTG_HS_HCINTMSK12;
    volatile    uint32_t    OTG_HS_HCTSIZ12;
    volatile    uint32_t    OTG_HS_HCDMA12;
    volatile    uint32_t    OTG_HS_HCCHAR13;
    volatile    uint32_t    OTG_HS_HCSPLT13;
    volatile    uint32_t    OTG_HS_HCINT13;
    volatile    uint32_t    OTG_HS_HCINTMSK13;
    volatile    uint32_t    OTG_HS_HCTSIZ13;
    volatile    uint32_t    OTG_HS_HCDMA13;
    volatile    uint32_t    OTG_HS_HCCHAR14;
    volatile    uint32_t    OTG_HS_HCSPLT14;
    volatile    uint32_t    OTG_HS_HCINT14;
    volatile    uint32_t    OTG_HS_HCINTMSK14;
    volatile    uint32_t    OTG_HS_HCTSIZ14;
    volatile    uint32_t    OTG_HS_HCDMA14;
    volatile    uint32_t    OTG_HS_HCCHAR15;
    volatile    uint32_t    OTG_HS_HCSPLT15;
    volatile    uint32_t    OTG_HS_HCINT15;
    volatile    uint32_t    OTG_HS_HCINTMSK15;
    volatile    uint32_t    OTG_HS_HCTSIZ15;
    volatile    uint32_t    OTG_HS_HCDMA15;
} OTG1_HS_HOST_TypeDef;

#ifdef __cplusplus
#define OTG1_HS_HOST    reinterpret_cast<OTG1_HS_HOST_TypeDef *>(0x40040400U)

#else
#define OTG1_HS_HOST    ((OTG1_HS_HOST_TypeDef *)0x40040400U)
#endif

// OTG_HS_HCFG Configuration

#define OTG1_HS_HOST_OTG_HS_HCFG_FSLSS          (0x1U<<2)
#define OTG1_HS_HOST_OTG_HS_HCFG_FSLSPCS        (0x3U<<0)
#define OTG1_HS_HOST_OTG_HS_HCFG_FSLSPCS_0      (0x1U<<0)

// OTG_HS_HFIR Configuration

#define OTG1_HS_HOST_OTG_HS_HFIR_FRIVL          (0xFFFFU<<0)
#define OTG1_HS_HOST_OTG_HS_HFIR_FRIVL_0        (0x1U<<0)

// OTG_HS_HFNUM Configuration

#define OTG1_HS_HOST_OTG_HS_HFNUM_FTREM         (0xFFFFU<<16)
#define OTG1_HS_HOST_OTG_HS_HFNUM_FTREM_0       (0x1U<<16)
#define OTG1_HS_HOST_OTG_HS_HFNUM_FRNUM         (0xFFFFU<<0)
#define OTG1_HS_HOST_OTG_HS_HFNUM_FRNUM_0       (0x1U<<0)

// OTG_HS_HPTXSTS Configuration

