Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM7_otg1_hs_host.h
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_CHENA      (0x1U<<31)
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_CHDIS      (0x1U<<30)
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_ODDFRM     (0x1U<<29)
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_DAD        (0x7FU<<22)
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_DAD_0      (0x1U<<22)
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_MC         (0x3U<<20)
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_MC_0       (0x1U<<20)
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_EPTYP      (0x3U<<18)
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_EPTYP_0    (0x1U<<18)
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_LSDEV      (0x1U<<17)
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_EPDIR      (0x1U<<15)
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_EPNUM      (0xFU<<11)
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_EPNUM_0    (0x1U<<11)
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_MPSIZ      (0x7FFU<<0)
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_MPSIZ_0    (0x1U<<0)

// OTG_HS_HCSPLT12 Configuration

#define OTG1_HS_HOST_OTG_HS_HCSPLT12_SPLITEN    (0x1U<<31)
#define OTG1_HS_HOST_OTG_HS_HCSPLT12_COMPLSPLT  (0x1U<<16)
#define OTG1_HS_HOST_OTG_HS_HCSPLT12_XACTPOS    (0x3U<<14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT12_XACTPOS_0  (0x1U<<14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT12_HUBADDR    (0x7FU<<7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT12_HUBADDR_0  (0x1U<<7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT12_PRTADDR    (0x7FU<<0)
#define OTG1_HS_HOST_OTG_HS_HCSPLT12_PRTADDR_0  (0x1U<<0)

// OTG_HS_HCINT12 Configuration

#define OTG1_HS_HOST_OTG_HS_HCINT12_DTERR       (0x1U<<10)
#define OTG1_HS_HOST_OTG_HS_HCINT12_FRMOR       (0x1U<<9)
#define OTG1_HS_HOST_OTG_HS_HCINT12_BBERR       (0x1U<<8)
#define OTG1_HS_HOST_OTG_HS_HCINT12_TXERR       (0x1U<<7)
#define OTG1_HS_HOST_OTG_HS_HCINT12_NYET        (0x1U<<6)
#define OTG1_HS_HOST_OTG_HS_HCINT12_ACK         (0x1U<<5)
#define OTG1_HS_HOST_OTG_HS_HCINT12_NAK         (0x1U<<4)
#define OTG1_HS_HOST_OTG_HS_HCINT12_STALL       (0x1U<<3)
#define OTG1_HS_HOST_OTG_HS_HCINT12_AHBERR      (0x1U<<2)
#define OTG1_HS_HOST_OTG_HS_HCINT12_CHH         (0x1U<<1)
#define OTG1_HS_HOST_OTG_HS_HCINT12_XFRC        (0x1U<<0)

// OTG_HS_HCINTMSK12 Configuration

#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_DTERRM   (0x1U<<10)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_FRMORM   (0x1U<<9)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_BBERRM   (0x1U<<8)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_TXERRM   (0x1U<<7)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_NYET     (0x1U<<6)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_ACKM     (0x1U<<5)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_NAKM     (0x1U<<4)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_STALLM   (0x1U<<3)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_AHBERR   (0x1U<<2)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_CHHM     (0x1U<<1)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_XFRCM    (0x1U<<0)

// OTG_HS_HCTSIZ12 Configuration

#define OTG1_HS_HOST_OTG_HS_HCTSIZ12_DPID       (0x3U<<29)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ12_DPID_0     (0x1U<<29)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ12_PKTCNT     (0x3FFU<<19)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ12_PKTCNT_0   (0x1U<<19)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ12_XFRSIZ     (0x7FFFFU<<0)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ12_XFRSIZ_0   (0x1U<<0)

// OTG_HS_HCDMA12 Configuration

#define OTG1_HS_HOST_OTG_HS_HCDMA12_DMAADDR     (0xFFFFFFFFU<<0)
#define OTG1_HS_HOST_OTG_HS_HCDMA12_DMAADDR_0   (0x1U<<0)

// OTG_HS_HCCHAR13 Configuration

#define OTG1_HS_HOST_OTG_HS_HCCHAR13_CHENA      (0x1U<<31)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_CHDIS      (0x1U<<30)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_ODDFRM     (0x1U<<29)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_DAD        (0x7FU<<22)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_DAD_0      (0x1U<<22)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_MC         (0x3U<<20)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_MC_0       (0x1U<<20)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_EPTYP      (0x3U<<18)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_EPTYP_0    (0x1U<<18)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_LSDEV      (0x1U<<17)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_EPDIR      (0x1U<<15)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_EPNUM      (0xFU<<11)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_EPNUM_0    (0x1U<<11)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_MPSIZ      (0x7FFU<<0)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_MPSIZ_0    (0x1U<<0)

// OTG_HS_HCSPLT13 Configuration

#define OTG1_HS_HOST_OTG_HS_HCSPLT13_SPLITEN    (0x1U<<31)
#define OTG1_HS_HOST_OTG_HS_HCSPLT13_COMPLSPLT  (0x1U<<16)
#define OTG1_HS_HOST_OTG_HS_HCSPLT13_XACTPOS    (0x3U<<14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT13_XACTPOS_0  (0x1U<<14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT13_HUBADDR    (0x7FU<<7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT13_HUBADDR_0  (0x1U<<7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT13_PRTADDR    (0x7FU<<0)
#define OTG1_HS_HOST_OTG_HS_HCSPLT13_PRTADDR_0  (0x1U<<0)

// OTG_HS_HCINT13 Configuration

#define OTG1_HS_HOST_OTG_HS_HCINT13_DTERR       (0x1U<<10)
#define OTG1_HS_HOST_OTG_HS_HCINT13_FRMOR       (0x1U<<9)
#define OTG1_HS_HOST_OTG_HS_HCINT13_BBERR       (0x1U<<8)
#define OTG1_HS_HOST_OTG_HS_HCINT13_TXERR       (0x1U<<7)
#define OTG1_HS_HOST_OTG_HS_HCINT13_NYET        (0x1U<<6)
#define OTG1_HS_HOST_OTG_HS_HCINT13_ACK         (0x1U<<5)
#define OTG1_HS_HOST_OTG_HS_HCINT13_NAK         (0x1U<<4)
#define OTG1_HS_HOST_OTG_HS_HCINT13_STALL       (0x1U<<3)
#define OTG1_HS_HOST_OTG_HS_HCINT13_AHBERR      (0x1U<<2)
#define OTG1_HS_HOST_OTG_HS_HCINT13_CHH         (0x1U<<1)
#define OTG1_HS_HOST_OTG_HS_HCINT13_XFRC        (0x1U<<0)

// OTG_HS_HCINTMSK13 Configuration

#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_DTERRM   (0x1U<<10)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_FRMORM   (0x1U<<9)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_BBERRM   (0x1U<<8)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_TXERRM   (0x1U<<7)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_NYET     (0x1U<<6)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_ACKM     (0x1U<<5)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_NAKM     (0x1U<<4)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_STALLM   (0x1U<<3)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_AHBERR   (0x1U<<2)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_CHHM     (0x1U<<1)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_XFRCM    (0x1U<<0)

// OTG_HS_HCTSIZ13 Configuration

